In [1]:
import pandas as pd
from zone_recovery.zone import *

In [2]:
test = Zone(1,2,3,4)

In [3]:
df  = pd.read_csv('processed_data/BNBUSTD_2018_Processed.csv')

In [4]:
test.calculateProfit(10,df,10)

(10, 8.3959, 10)

In [5]:
df

        Unnamed: 0   Price  Year  Month  Day  Hour  Minute
0                0  8.3959  2018      1    1     0       0
1                1  8.3693  2018      1    1     0       1
2                2  8.3500  2018      1    1     0       2
3                3  8.3010  2018      1    1     0       3
4                4  8.3147  2018      1    1     0       4
...            ...     ...   ...    ...  ...   ...     ...
525595      525595  6.1214  2018     12   31    23      55
525596      525596  6.1211  2018     12   31    23      56
525597      525597  6.1153  2018     12   31    23      57
525598      525598  6.1224  2018     12   31    23      58
525599      525599  6.1202  2018     12   31    23      59

[525600 rows x 7 columns]

In [8]:
for i,row in df[0:10].iterrows():
    print(i)

0
1
2
3
4
5
6
7
8
9